#define _CRT_SECURE_NO_WARNINGS 1
#pragma warning(disable:6031)


                           //操作符相关知识

//1.算术操作符

//   + - * / %

/*

1. 除了 % 操作符之外，其他的几个操作符可以作用于整数和浮点数。
2. 对于 / 操作符如果两个操作数都为整数，执行整数除法。而只要有浮点数执行的就是浮点数除法。
3. % 操作符的两个操作数必须为整数。返回的是整除之后的余数


*/




//2.移位操作符

/*
<< 左移操作符        //把二进制位向左移动一位
>> 右移操作符        //把二进制位向右移动一位

*/

//左移操作符 移位规则：左边抛弃、右边补0

/*
#include <stdio.h>

int main()
{
    int a = 2;
    //a是整形变量，占4个字节
    //写出a的32位二进制位   00000000000000000000000000000010

    int b = a << 1;
    //把a向左移动1位        00000000000000000000000000000100
    //按照规则，左边抛弃，右边补0

    printf("%d ",b);   //所以最后的打印结果是4

    return 0;
}

*/


//右移操作符 移位规则：首先右移运算分两种：
//1. 逻辑移位 左边用0填充，右边丢弃
//2. 算术移位 左边用原该值的符号位填充，右边丢弃

/*
#include <stdio.h>

int main()
{
    //当前平台右移是按照算数移位进行的

    int a = -1;
    int b = a >> 1;
    printf("%d ", b);

    return 0;
}

*/


//警告⚠： 对于移位运算符，不要移动负数位，这个是标准未定义的




//3.位操作符

/*

//这里面的位是二进制位的意思

& //按位与 &
| //按位或 |       // | 操作符，二进制位只要有一个 1 就为 1
^ //按位异或 ^     // ^ 操作符，二进制位相同为 0 相异为 1

注：他们的操作数必须是整数

*/


/*
#include <stdio.h>

int main()
{
    int a = 3;
    //a的二进制位  00000000000000000000000000000011

    int b = 5;
    //b的二进制位  00000000000000000000000000000101


    int c = a & b;
    //
      //00000000000000000000000000000011
      //00000000000000000000000000000101
    //c=00000000000000000000000000000001

    //& 操作符，二进制位都是1 时才为1  ，有一个为 0 就是0

    printf("%d ",c);


    return 0;
}

*/




//一道变态的面试题：
 
//不能创建临时变量（第三个变量），实现两个数的交换

//方法1 
/*
#include <stdio.h>
int main()
{
    int a = 10;
    int b = 20;
    a = a + b;
    b = a - b;
    a = a - b;
    printf("a = %d b = %d\n", a, b);
    return 0;
}

*/

//上述这种方法存在缺陷，就是数字太大时会溢出


//方法2

/*
#include <stdio.h>
int main()
{
    int a = 10;
    int b = 20;
    a = a ^ b;
    b = a ^ b;
    a = a ^ b;
    printf("a = %d b = %d\n", a, b);
    return 0;
}

*/





//编写代码实现：求一个整数存储在内存中的二进制中1的个数

//方法1

/*
#include <stdio.h>
int main()
{
    int num = 10;
    int count = 0;//计数
    while (num)
    {
        if (num % 2 == 1)
            count++;
        num = num / 2;
    }
    printf("二进制中1的个数 = %d\n", count);
    return 0;

}


*/

//方法2：

/*
#include <stdio.h>
int main()
{
    int num = -1;
    int i = 0;
    int count = 0;//计数
    for (i = 0; i < 32; i++)
    {
        if (((num >> i) & 1) == 1)
            count++;
    }
    printf("二进制中1的个数 = %d\n", count);
    return 0;
}

*/


/*

#include <stdio.h>
int main()
{
    int num = -1;
    int i = 0;
    int count = 0;//计数
    while (num)
    {
        count++;
        num = num & (num - 1);
    }
    printf("二进制中1的个数 = %d\n", count);
    return 0;
}

*/



